# Titanic Dataset : Exploratory Data Analysis for Begineer

In [2]:
# import the libs
import numpy as np
import pandas as pd

## Loading the Titanic Dataset

In [4]:
# load the dataset
df = pd.read_csv("/home/anis/code/jnotebook/Titanic-Dataset.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Explore the Data

In [5]:
df.shape

(891, 12)

The dataset contains 891 rows and 12 columns

In [6]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

Here we can see that the dataset has null values for Cabin > Age > Embarked

In [9]:
df.Age.isnull().sum()

177

In [10]:
df.Cabin.isnull().sum()

687

In [11]:
df.Embarked.isnull().sum()

2

In [17]:
df.groupby('Sex').Survived.sum()

Sex
female    233
male      109
Name: Survived, dtype: int64

From the dataset we can see that, female survival rate is higher than male

# Cleaning the dataset

In [22]:
# Here we dont need the ticket, cabin columns so removing it

In [24]:
df.drop(["Ticket","Cabin"],axis=1,inplace=True)

In [25]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S

In [26]:
df.Age.median()

28.0

/tmp/ipykernel_21499/1933487976.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].median(), inplace=True)

In [33]:
df.Survived.value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

In [34]:
df.groupby('Sex')['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [36]:
df.groupby('Pclass').Survived.mean()

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [38]:
df[df['Survived'] == 1]['Age'].describe()

count    342.000000
mean      28.291433
std       13.764425
min        0.420000
25%       21.000000
50%       28.000000
75%       35.000000
max       80.000000
Name: Age, dtype: float64

In [39]:
df[df['Survived']==0]['Age'].describe()

count    549.000000
mean      30.028233
std       12.499986
min        1.000000
25%       23.000000
50%       28.000000
75%       35.000000
max       74.000000
Name: Age, dtype: float64

In [40]:
df['Is_Child']=df.Age<18

In [41]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Is_Child
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,False
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S,False
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S,False
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S,False

In [45]:
df.groupby('Is_Child').Survived.mean()

Is_Child
False    0.361183
True     0.539823
Name: Survived, dtype: float64

In [46]:
df.Is_Child.value_counts()

Is_Child
False    778
True     113
Name: count, dtype: int64

In [47]:
df['Adults']=df.Age>18

In [48]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Is_Child,Adults
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,False,True
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,False,True
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S,False,True
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S,False,True
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S,False,True

In [50]:
# Adults survival rate
df.groupby('Adults').Survived.mean()

Adults
False    0.503597
True     0.361702
Name: Survived, dtype: float64

In [53]:
df.groupby('Pclass').Survived.mean()

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

üî• Recommended Starter Project: Exploratory Data Analysis (EDA) on a Real Dataset
Example Dataset Ideas (Pick one):

Titanic survival dataset (classic, clean)

Netflix Movies and TV Shows dataset

IPL dataset / Football player stats

E-commerce sales data

Your own academic results, expenses, etc.

üõ†Ô∏è Project Steps You Can Follow
Load the Dataset

Use Pandas to load a .csv file

Explore the Data

.head(), .info(), .describe()

Check data types and null values

Clean the Data

Handle missing values

Rename columns

Convert data types

Analyze the Data

Use .groupby(), .value_counts(), .agg(), etc.

Find trends, max/min, averages, and unique values

Transform the Data (optional)

Create new columns

Apply functions with .apply() or NumPy

(Bonus) Visualize it (only if you're ready to try Matplotlib or Seaborn)